//
//  MarketDataModel.swift
//  SwiftfulCrypto (iOS)
//
//  Created by 박승훈 on 2022/01/01.
//

import Foundation

// JSON Data:
/*
 URL:   https://api.coingecko.com/api/v3/global
 
 {
   "data": {
     "active_cryptocurrencies": 12134,
     "upcoming_icos": 0,
     "ongoing_icos": 50,
     "ended_icos": 3375,
     "markets": 699,
     "total_market_cap": {
       "btc": 49721860.50982998,
       "eth": 629777524.6123276,
       "ltc": 15791412092.536886,
       "bch": 5347352413.643608,
       "bnb": 4528689066.416632,
       "eos": 761724385670.3444,
       "xrp": 2774755196236.189,
       "xlm": 8646401749741.369,
       "link": 117950032336.09424,
       "dot": 85829344845.99088,
       "yfi": 70583143.77694665,
       "usd": 2346061836283.607,
       "aed": 8617085124669.665,
       "ars": 240917078237654.44,
       "aud": 3229490189230.887,
       "bdt": 201145296041604.2,
       "bhd": 884364431619.9597,
       "bmd": 2346061836283.607,
       "brl": 13070614308486.834,
       "cad": 2965539464154.289,
       "chf": 2138913960387.1096,
       "clp": 1998844684513633.2,
       "cny": 14911334425234.967,
       "czk": 51313650998654.09,
       "dkk": 15341109493023.771,
       "eur": 2062662258584.2166,
       "gbp": 1733777234002.9653,
       "hkd": 18290132681850.62,
       "huf": 761789738859651.2,
       "idr": 33412612672351120,
       "ils": 7292404769430.518,
       "inr": 174819261095601,
       "jpy": 270050485850933.5,
       "krw": 2789185995920853.5,
       "kwd": 709735318836.1909,
       "lkr": 476066734128575.44,
       "mmk": 4172266448505564.5,
       "mxn": 48087933276855.93,
       "myr": 9798327259238.457,
       "ngn": 966460173457029.6,
       "nok": 20687655384513.086,
       "nzd": 3428914829562.338,
       "php": 119649153650464.06,
       "pkr": 418185522317552.56,
       "pln": 9467063327955.252,
       "rub": 175465718434588.78,
       "sar": 8807526694229.986,
       "sek": 21231976921458.45,
       "sgd": 3164016295503.8857,
       "thb": 77878111516955.28,
       "try": 31252124327317.562,
       "twd": 65026030522456.4,
       "uah": 64019408116424.09,
       "vef": 234911171667.0773,
       "vnd": 53419828012177680,
       "zar": 37422137923342.44,
       "xdr": 1673246492565.0115,
       "xag": 100622427933.87524,
       "xau": 1282662387.7513373,
       "bits": 49721860509829.984,
       "sats": 4972186050982998
     },
     "total_volume": {
       "btc": 1732846.8546013709,
       "eth": 21948253.573644098,
       "ltc": 550343420.2518775,
       "bch": 186359535.13033697,
       "bnb": 157828458.62447622,
       "eos": 26546707871.501793,
       "xrp": 96702451693.98088,
       "xlm": 301334059547.048,
       "link": 4110653552.340891,
       "dot": 2991221742.7879233,
       "yfi": 2459879.365487093,
       "usd": 81762143089.97235,
       "aed": 300312351569.46765,
       "ars": 8396154065098.545,
       "aud": 112550332167.64609,
       "bdt": 7010075447491.48,
       "bhd": 30820812172.766712,
       "bmd": 81762143089.97235,
       "brl": 455521427797.16205,
       "cad": 103351436972.87941,
       "chf": 74542872903.70015,
       "clp": 69661345912656.445,
       "cny": 519672005265.5549,
       "czk": 1788322034199.6467,
       "dkk": 534650012258.2073,
       "eur": 71885439728.98975,
       "gbp": 60423531937.778984,
       "hkd": 637425843743.7332,
       "huf": 26548985482744.965,
       "idr": 1164456441887386,
       "ils": 254146175095.1466,
       "inr": 6092591942599.532,
       "jpy": 9411476766800.54,
       "krw": 97205376676806.3,
       "kwd": 24734847051.86467,
       "lkr": 16591308819828.992,
       "mmk": 145406843543643.2,
       "mxn": 1675903175558.0886,
       "myr": 341479590615.26855,
       "ngn": 33681914845914.03,
       "nok": 720981439442.3833,
       "nzd": 119500441378.86606,
       "php": 4169869297588.5938,
       "pkr": 14574102005787.559,
       "pln": 329934776010.9659,
       "rub": 6115121501127.968,
       "sar": 306949393534.79614,
       "sek": 739951483071.4039,
       "sgd": 110268514278.29117,
       "thb": 2714114862169.5493,
       "try": 1089161684315.8309,
       "twd": 2266209496239.0737,
       "uah": 2231127895265.605,
       "vef": 8186843387.598922,
       "vnd": 1861723998158668.8,
       "zar": 1304191623724.5876,
       "xdr": 58313986883.91458,
       "xag": 3506772593.778894,
       "xau": 44701816.49158061,
       "bits": 1732846854601.3708,
       "sats": 173284685460137.1
     },
     "market_cap_percentage": {
       "btc": 38.045349241390745,
       "eth": 18.892371514990135,
       "bnb": 3.7132321913915267,
       "usdt": 3.3462702439306433,
       "sol": 2.2834823562010196,
       "ada": 1.8293552595049316,
       "usdc": 1.8131880950236026,
       "xrp": 1.7131588124057266,
       "luna": 1.3694658626884941,
       "dot": 1.2465317951462664
     },
     "market_cap_change_percentage_24h_usd": -1.3751754031036822,
     "updated_at": 1641043415
   }
 }
 */
 
struct GlobalData: Codable {
    let data: MarketDataModel?
}

struct MarketDataModel: Codable {
  
    let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]
    let marketCapChangePercentage24HUsd: Double
  
  enum CodingKeys: String, CodingKey {
    case totalMarketCap = "total_market_cap"
    case totalVolume = "total_volume"
    case marketCapPercentage = "market_cap_percentage"
    case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd"
  }
  
  var marketCap: String {
//    if let item = totalMarketCap.first(where: { (key, value) -> Bool in
//      return key == "usd"
//    }) {
//      return "\(item.value)"
//    }
    if let item = totalMarketCap.first(where: { $0.key == "usd" }) {
      return "\(item.value)"
    }
    return ""
  }
  
  var volume: String {
    if let item = totalVolume.first(where: { $0.key == "usd"}) {
      return "\(item.value)"
    }
    return ""
  }
  
  var btcDominance: String {
    if let item = marketCapPercentage.first(where: { $0.key == "btc" }) {
      return item.value.asPercentString()
    }
    return ""
  }
}
